//MULTG022       JOB  1,NOTIFY=&SYSUID
//STEP1          EXEC PGM=ICEGENER
//SYSUT1         DD DSN=UNTG022.COBOLIN(AUTODATA),DISP=SHR
//SYSUT2         DD DSN=UNTG022.COBOLOUT(GENEROUT),DISP=SHR
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD DUMMY
//STEP2          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD *
  DELETE UNTG022.COBOLIN(AUTONEW)
/*
//STEP3          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD *
  DELETE UNTG022.COBOLIN(NEWLIST)
/*
//STEP4          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//OLDINV         DD DSN=UNTG022.COBOLIN(AUTODATA),DISP=SHR
//NEWINV         DD DSN=UNTG022.COBOLIN(AUTONEW),DISP=SHR
//SYSIN          DD *
  REPRO INFILE(OLDINV)  OUTFILE(NEWINV)
/*
//STEP5          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//STUFF          DD DSN=UNTG022.COBOLIN(AUTONEW),DISP=SHR
//SYSIN          DD *
  PRINT INFILE(STUFF) CHAR
/*
//STEP6          EXEC PGM=IKJEFT01
//SYSPRINT       DD SYSOUT=*
//SYSTSPRT       DD SYSOUT=*
//SYSTSIN        DD *
  RENAME 'UNTG022.COBOLIN(AUTONEW)''UNTG022.COBOLIN(ITDSDATA)'
/*
//STEP7          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//STUFF1         DD DSN=UNTG022.COBOLIN(ITDSDATA),DISP=SHR
//SYSIN          DD *
  PRINT INFILE(STUFF1) CHAR
/*
//STEP8          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//OLDINV1        DD DSN=UNTG022.COBOLIN(ITDSDATA),DISP=SHR
//NEWINV1        DD DSN=UNTG022.COBOLIN(NEWLIST),DISP=SHR
//SYSIN          DD *
  REPRO INFILE(OLDINV1)  OUTFILE(NEWINV1)
/*
//STEP9          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//STUFF2         DD DSN=UNTG022.COBOLIN(NEWLIST),DISP=SHR
//SYSIN          DD *
  PRINT INFILE(STUFF2) CHAR
/*
//STEP10         EXEC PGM=IKJEFT01
//SYSPRINT       DD SYSOUT=*
//SYSTSPRT       DD SYSOUT=*
//SYSTSIN        DD *
  RENAME 'UNTG022.COBOLIN(NEWLIST)''UNTG022.COBOLIN(FINALCAR)'
/*
//STEP11         EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//STUFF3         DD DSN=UNTG022.COBOLIN(FINALCAR),DISP=SHR
//SYSIN          DD *
  PRINT INFILE(STUFF3) CHAR
/*
//STEP12         EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD *
  DELETE UNTG022.COBOLIN(ITDSDATA)
/*
//